// 🔹 1. Math.round()

// पास की सबसे नज़दीकी पूरी संख्या में बदल देता है।

// अगर दशमलव 0.5 या उससे ज़्यादा है ➝ ऊपर की संख्या में राउंड होगा
// अगर दशमलव 0.5 से कम है ➝ नीचे की संख्या में राउंड होगा

Math.round(4.4); // 4
Math.round(4.5); // 5
Math.round(4.6); // 5
///////////////////////////////////////////////////////////////

// 🔹 2. Math.floor()

// यह नीचे की ओर राउंड करता है। यानी हमेशा नीचे वाली पूरी संख्या देगा।

Math.floor(4.9); // 4
Math.floor(4.1); // 4
Math.floor(-4.1); // -5
//////////////////////////////////////////////////////////////

// 🔹 3. parseFloat()

// स्ट्रिंग से दशमलव संख्या (point वाली) निकालता है।

parseFloat("12.34"); // 12.34
parseFloat("56.78abc"); // 56.78
parseFloat("abc123"); // NaN
////////////////////////////////////////////////////////////

// 🔹 4. parseInt()

// स्ट्रिंग से पहली पूरी संख्या निकालता है, लेकिन दशमलव के बाद सब हटा देता है।

parseInt("12.34"); // 12
parseInt("56abc"); // 56
parseInt("abc123"); // NaN
////////////////////////////////////////////////////////////////

// 🔹 5. Number()

// यह किसी भी वैल्यू को (string, boolean, etc.) उसे proper number बनाने की कोशिश करता है, चाहे वो integer हो या float।

Number("12.34"); // 12.34
Number("56"); // 56
Number(true); // 1
Number(false); // 0
Number("abc"); // NaN
////////////////////////////////////////////////////////////////

// Function        काम क्या करता है?                  Example Result
// Math.round()	   पास की पूरी संख्या में राउंड करता है    Math.round(4.6) → 5
// Math.floor()	   नीचे वाली पूरी संख्या में राउंड करता है	 Math.floor(4.6) → 4
// parseFloat()	   स्ट्रिंग से दशमलव संख्या निकालता है	   parseFloat("12.34abc") → 12.34

// parseInt()	   स्ट्रिंग से पहली पूरी संख्या निकालता है	  parseInt("12.34abc") → 12

// Number()	       किसी भी वैल्यू को नंबर में बदलने की कोशिश करता है	Number("12.34") → 12.34
